% 今天的作业实际是没有难度的， 特别是lec8极其简单
% 希望是感受一些经典， 而不是挑战难度
% 天马行空， 希望能够突破一些机器学习的思维
% 灵感来源：tanh, 在神经网络有名， 工业化之后，引起学生的高看
% 实际在数学里，更有名。。
% h1: 
% 画图  
% f(x) = g(x)/h(x)
% g(x) = 1 * 3 * 5 * 7 * 9  * ....
% h(x) = 2 * 4 * 6 * 8 * 10 * ....
% n趋于无穷大，
% 先算g(x), 再算h(x)
% 第二种: f(x) = 1/2 * 3/4 * 5/6 * 7/8

% h2: 牛顿三叉线 y = x^2 + 1/x
% h3: 牛顿蛇形线 y = 2x / ( 1+x^2)
% h4: 蔓叶线     y = (正负) x * sqrt(x / (10 - x))
% h5: y = sin(1/x)
% h6: y = x * (2 + sin(1/x)) 性质: y <=x 
% h7: y = （正负) sqrt(1-x^2) sin(pi/x)
% h8: y = sin(x)/x