///////////////////////////////////////////////////////
///水仙花数               ///////////////////////////// 
///计算机170205刘九洲     /////////////////////////////
///////////////////////////////////////////////////////

///(法一)
#include<stdio.h>
int main ()
{
	long int a,b,c;
	printf("三位数的水仙花数：\n");
	for(a=1;a<=9;a++)
	{
		for(b=0;b<=9;b++)
		{
			for(c=0;c<=9;c++)
			{
				if(100*a+10*b+1*c==a*a*a+b*b*b+c*c*c)	
				printf("%d\n",100*a+10*b+1*c);
			}
		}
	}

	return 0;
}


///(法二)

/*

#include<stdio.h>

int main()
{
	int a,b,c,i;
	printf("三位数的水仙花数：\n");
	for(i=101;i<=999;i++)
	{
		c=i%10;b=(i/10)%10;a=i/100;
		if(a*a*a+b*b*b+c*c*c==i)
		    printf("%d ",i);
	}
	return 0;
}
*/
